Revit 2027 API
CutMarkType.CutLineType Property
 The cut line type of the cut mark.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CutLineType CutLineType { get; set; }
Public Property CutLineType As CutLineType
	Get
	Set
public:
property CutLineType CutLineType {
	CutLineType get ();
	void set (CutLineType value);
}
member CutLineType : CutLineType with get, set
Property Value
CutLineType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace